app/Controllers/admin/pedidos.php

SELECT `p`.*, `u`.`username`, `ai`.`secret` as `email`, `pl`.`nombre` as `plato_nombre`, `pl`.`precio`, `pl`.`stock`, `pl`.`stock_ilimitado`
FROM `pedidos` as `p`
LEFT JOIN `users` as `u` ON `u`.`id` = `p`.`usuario_id`
LEFT JOIN `auth_identities` as `ai` ON `ai`.`user_id` = `u`.`id` AND `ai`.`type` = "email_password"
LEFT JOIN `platos` as `pl` ON `pl`.`id` = `p`.`plato_id`
ORDER BY `p`.`id` DESC
---
    public function index()
    {
        // Verificar que sea admin
        if (!auth()->user()->inGroup('admin')) {
            return redirect()->to('/')->with('error', 'Acceso denegado');
        }

        // Obtener todos los pedidos con información del usuario y plato
        $pedidos = $this->db->table('pedidos as p')
            ->select('p.*,
                      u.username,
                      ai.secret as email,
                      pl.nombre as plato_nombre,
                      pl.precio,
                      pl.stock,
                      pl.stock_ilimitado')
            ->join('users as u', 'u.id = p.usuario_id', 'left')
            ->join('auth_identities as ai', 'ai.user_id = u.id AND ai.type = "email_password"', 'left')
            ->join('platos as pl', 'pl.id = p.plato_id', 'left')
            ->orderBy('p.id', 'DESC')
            ->get()
            ->getResultArray();