app/Controllers/Home.php

SELECT *
FROM `platos`
WHERE `disponible` = 1
AND   (
`stock_ilimitado` = 1
OR `stock` > 0
 )
ORDER BY `categoria` ASC, `nombre` ASC
---
    public function index()
    {
        $cache = \Config\Services::cache();

        // Intentar obtener platos del caché (caché de 5 minutos)
        $platos = $cache->get('platos_disponibles');

        if ($platos === null) {
            // Si no está en caché, obtener de la base de datos
            $db = \Config\Database::connect();

            $platos = $db->table('platos')
                ->where('disponible', 1)
                ->groupStart()
                    ->where('stock_ilimitado', 1)
                    ->orWhere('stock >', 0)
                ->groupEnd()
                ->orderBy('categoria', 'ASC')
                ->orderBy('nombre', 'ASC')
                ->get()
                ->getResultArray();