app/Controllers/menu.php

SELECT *
FROM `platos`
WHERE `disponible` = 1
AND   (
`stock_ilimitado` = 1
OR `stock` > 0
 )
ORDER BY `categoria` ASC, `nombre` ASC
---
    public function index()
    {
        $db = \Config\Database::connect();

        // Obtener solo los platos disponibles Y con stock
        // (disponible = 1) AND (stock_ilimitado = 1 OR stock > 0)
        $platos = $db->table('platos')
            ->where('disponible', 1)
            ->groupStart()
                ->where('stock_ilimitado', 1)
                ->orWhere('stock >', 0)
            ->groupEnd()
            ->orderBy('categoria', 'ASC')
            ->orderBy('nombre', 'ASC')
            ->get()
            ->getResultArray();