app/Models/CajaChicaModel.php

    public function getMovimientosPorFecha($fecha)
    {
        return $this->where('fecha', $fecha)
                    ->orderBy('hora', 'DESC')
                    ->findAll();
---
SELECT *
FROM `caja_chica`
WHERE `fecha` = '2025-11-09'
ORDER BY `hora` ASC